app/Controllers/Chat.php

SELECT *
FROM `users`
WHERE `id` != '1'
---
    public function getUsers()
    {
        $userModel = new UserModel();
        $currentUserId = session()->get('user_id');
        $users = $userModel->where('id !=', $currentUserId)->findAll();