app/Models/MessageModel.php

SELECT *
FROM `messages`
WHERE (`sender_id` = 1 AND `receiver_id` = 2)
OR (`sender_id` = 2 AND `receiver_id` = 1)
ORDER BY `created_at` ASC
---
    public function getMessages($sender_id, $receiver_id)
    {
        return $this->where("(sender_id = $sender_id AND receiver_id = $receiver_id)")
            ->orWhere("(sender_id = $receiver_id AND receiver_id = $sender_id)")
            ->orderBy('created_at', 'ASC')
            ->findAll();